**Display all students sorted by their marks in descending order (highest marks first).**

In [1]:
import pandas as pd  

data = {
    "Name": ["Ali", "Sara", "John", "Mary", "Alex"],
    "Subject": ["Math", "Science", "Math", "Science", "Math"],
    "Marks": [85, 92, 78, 88, 95]
}

df = pd.DataFrame(data)

In [2]:
df

   Name  Subject  Marks
0   Ali     Math     85
1  Sara  Science     92
2  John     Math     78
3  Mary  Science     88
4  Alex     Math     95

In [9]:
df.sort_values(by="Marks",ascending=False)

   Name  Subject  Marks
4  Alex     Math     95
1  Sara  Science     92
3  Mary  Science     88
0   Ali     Math     85
2  John     Math     78